import 'package:flutter/material.dart';
import 'package:slichot3/models/day.dart';
import 'package:slichot3/widgets/day_item.dart';
import 'package:slichot3/widgets/drawer_Page.dart';


class DayOverViewScreen extends StatelessWidget {
   final List<Day> daylist = [
      Day(
        id: 'd1',
        title: 'ריבת התות שדה',
        content: """
<p >
     זה אחד הסיפורים הרבים על טילר, הידיד היקר שלי. ההורים
שלכם יכולים אולי לחשוב כי זה מוזר שידיד שלי הוא דווקא
עכבר. אבל אתם, ילדים, בוודאי מבינים זאת. נכון?
כך חשבתי.
זה קרה לפני קצת יותר משבוע, אחרי מסיבת העכברים
מופלאה וקסומה של ראש השנה.
אני ביליתי את ראש השנה עם ידידי הישן והיקר מר בני
הגירית. הכל היה פשוט ושקט. בני הכין עוגה וקצת כעכים
וחלב. נהנינו לשבת ליד האח ובחצות הקשבנו גם לשירים
אחדים שאהבנו. אפילו פרדי השועל ביקר כדי לנגוס קצת
מעוגת האוכמניות הטעימה של בני.
אבל העכברים חשבו על משהו יותר מרשים, משהו שערכו
מדי שנה באולם תת-קרקעי של המסיבות. הם באו מכל
קצוות היער וחגגו עד מאוחר
בלילה.
השמלות היפות וחליפות המסיבה
יצרו מראה נהדר, ואם יורשה לי
לומר, גברות עכברות נראו
בשמלותיהן הרבה יותר יפה
מאשר בנוות-אדם יכולות בכלל
להראות.
טילר ואשתו מילי הגיעו לכניסה
בדיוק כשהסעודה הגדולה עמדה
להתחיל. דודי, העכבר שתפקידו
היה לעמוד בכניסה ולברך את הבאים, נתן להם בחיוך רחב
קליפות אגוז מלאות דבש חם ומתוק ואיחל להם ערב נעים.
הם ירדו בגרם המדרגות הארוך, נכנסו לאולם, ותוך זמן קצר
התחילו, כמו גם שאר עכברים שמחים וחברותיים, להתכבד
בפרות טעימים ובאגוזים שנפרשו לאורך שולחן ארוך וצר,
התזמורת נגינה על כינורות הקטנים שלה, אותם כיוון עוד
בבוקר העכביש רוני, ומקהלת של שישה עכברים שרה
בתאום מופלא, כך שגם הצלילים באולם היו ללא דופי. בשעת
חצות כל העכברים רקדו וחגגו בשמחה, ואחר כך התפזרו,
כל אחד בדרכו הביתה.
מובן שבדרך לביתם
טילר ומילי באו לביתי
כדי לספר לנו על
החגיגה, אבל טילר
התלונן שבמסיבה לא
הוגשה כל מרקחת או
ריבה.
"לא הגישו מרקחת,
עלמה גרסייה, אפילו כף
אחת של מרקחת או
ריבת תות שדה לא
נראתה, אף לא אחת!" הוא סיפר.
כי עליכם לדעת שבדומה לפרדי השועל שהיה לקקן גדול, גם
טילר אהב מעל הכל את הטעם הדביק והמתוק של ריבה. 
ולצערו, בני הגירית, שנהג להכין מאכלים מופלאים, אף פעם
עוד לא עשה ריבת תות שדה. לכן גם אצלנו לא יכול היה
וטילר לטעום מה שאהב.
אבל טילר ידע איפה הוא יוכל להשיג קצת ריבה. כי ממש
בקצה היער עמד בית קטן ובו גר האיכר פרנקי. לא היו לו
ילדים והוא חי לבדו. והוא עשה ריבה. לא סתם ריבה של
 ריבת
אוכמניות או פטל, אלה את הריבה האהובה על טילור –
תות שדה.
"מממ. ריבת תות שדה טרייה" אמר טילר כשהתעורר
למחרת בבוקר. הוא ליקק את שפתיו הקטנות כשחשב עליה,
ואז דחף את השמיכה בה היה מכוסה וקם ממיטת הקש
הנוחה שלו. הוא
פתח את ארון
הבגדים ובחר מהר
את מעילו הכחול
והצעיף האדום.
התלבש במהירות
ובהתרגשות רץ
לאורך הפרוזדור
הארוך וצר אל
הסלון.
כאן עמדה מילי
אשתו שבדיוק
חזרה מטיול
הבוקר שלה, שם קטפה כמה פרחים קטנים. היא הורידה את
כפפותיה הורודות הקטנות והייתה מסדרת את הפרחים
באגרטל קטן שעמד על שולחן האוכל.
מילי הייתה מופנית אל
טילר בגבה ולא ראתה
אותו, והוא התגנב
בשקט מאחוריה, יצא
מהבית ורץ דרך היער
לכוון ביתו של פרנקי
האיכר.
בדרך הוא עבר ליד
פרדי השועל, שהלך אל
בני הגירית לארוחת
בוקר של דבש
ואוכמניות.
"מה אתה עושה בשעות הבוקר כל כך מוקדמות?" קרא
אחריו פרדי, שניסה להשיג את העכבר המהיר. טילר היה כל
כך מרוגש שכמעט ולא שמע את פרדי, ובכל זאת עצר,
הסתובב אליו ושאל "מממ? או.. אל תספר למילי, אבל אני
הולך לביתו של האיכר פרנקי לקחת קצת ריבה."
"ריבה? זה משהו מתוק, טילר?"
יטוי פניו של פרדי אמר לטילר כי גם הוא מוכן לטעום קצת
ב
מהמתוק המתוק הזה, לאכן עשה הצגה קטנה והניף זרועות
בהתרגשות: 
"כן, כמובן. זה דווקא הדבר המתוק ביותר שתוכל לתאר
לעצמך, פרדי."
"באמת כל כך טוב?"
טילר רצה מאוד שפרדי ילך אתו אל בית האיכר. הוא יכול
היה להיות אז בטוח שפרדי לא ירוץ מיד למילי ולא יספר לה
מה מתכוון לעשות בעלה.
כי בניגוד לבני הגירית, שלא התערב אף פעם בענייני
האחרים, פרדי השועל היה
הרכלן של היער, וידוע היה
לכל שהוא לא יכול לשמור
על סוד כלשהו, וגם הכמוס
ביותר, למרות שלבו היה
טוב ונדיב.
"טוב. הבה נלך. אבוא אתך
לפני שאבקר אצל בני."
"בוא פרדי. תראה שלא
תצטער."
בינתיים, בבית של טילר,
שם בין שורשי האלון הזקן,
מילי העכברה העליזה התחילה לדאוג לאן נעלם בעלה.
"איפה הוא? בדרך כלל הוא כבר קם מהמיטה בשעות האלה
ובא לאכול ארוחת בוקר, וי..וי" היא נכנסה לחדר השינה
וראתה את המיטה הריקה.
?" היא
"איפה הוא יכול...
גרדה את ראשה ואז
הרגישה שארון הבגדים
פתוח וחסרים בו המעיל
הכחול והצעיף האדום של
בעלה.
"וי! וי! הוא שוב הלך לבית
האיכר פרנקי, והרי היום יום
ראשון והאיכר נשאר בבית!"
היא לבשה מיד את המעיל
שלה ומיהרה דרך היער
לכיוון ביתו של האיכר.
בינתיים טילר ופרדי הגיעו
כבר לשם ועמדו בפני הדלת האחורית של הבית. פרדי דחף
את דלת העץ הישנה והם נכנסו דרכה לחדר המזווה, מלא
שקי תפוחי אדמה
וקופסאות שמורים.
"אהא!" לחש טילר
כשראה את צנצנות
הריבה על המדף העליון
"תרים אותי, פרדי."
פרדי עזר לטילר לעלות
על המדף ובעצמו לקח
משם אחת הצנצנות 
והתיישב ליד השקים כדי לטעום ממנה.
טילר בחר צנצנת אחת, קפץ עליה והתחיל לקרוע את הניר
המכסה אותה, עד שהוריד אותו כליל.
 טילר צדקת. זה מענג ממש." מצמץ בשפתיים פרדי.
"ממ...
"אמרתי לך, פרדי" וטילר תקע את ראשו לתוך צנצנת הריבה,
נהנה מטעמה, כשזנבו הארוך
מתנופף באוויר.
"סנאפ!"
"אוי!"
"מה קרה, טילר? שאל פרדי
כששמע את הרעש המוזר
והזעקה.
טילר הסתכל אחורה וראה
מלכודת עכברים סגורה.
ופתאום נפתחה דלת חדר
המזווה ובה נעמד האיכר פרנקי.
הוא היה גבוה והחזיק רובה הצייד בידו.
"הה, מזיקים! אתם נהנים כאן, מה?" קרא.
"הרי טילר אמר שאינך בבית!" לחש פרדי שעמד כמו קפוא
מרוב פחד.
האיכר כיוון את הרובה על פרדי. הוא היה כבר לוחץ על
ההדק אילו טילר לא היה פתאום קופץ על ראשו ומסיח את
תשומת לבו. פרדי הספיק עוד להשתחל בין רגליו וברח דרך
הדלת. טילר רץ אחריו. הם רצו מהר כמה שרק יכלו ושמעו
איך האיכר פרנקי יורה אחריהם. עוד לפני שהם הספיקו
להגיע ליער הכדורית עופרת אחת פגע ברגלו האחורית של
פרדי. הם נעמדו בין העצים ונשמו כבדות, מנסים להירגע.
"ובכן.. נסכים שנינו.. אני חושב.. שלא ננסה זאת שוב."
"לא, פרדי. בוודאי שלא."
ופתאום נשמע ביער קולה של מילי..
"טילר,, טילר! וי! וי! טילר!" קראה לבעלה.
"אני כאן. למה את צועקת?"
"הו, איזה מזל.. חשבתי שכבר הרגו אתך. ממש כך!"
"לא. אני בסדר, בריא ושלם."
ופתאום מילי ראתה שלטילר קרה דבר איום.
"שלם? הו, טילר. איפה הזנב היפה הארוך שלך?"
טילר התחיל ללכת במעגל, מביט מעל כתפיים שלו, אך את
זנבו לא ראה. הזנב נשאר כנראה במלכודת העכברים בבית
האיכר.
מאוחר יותר הם הגיעו אלי הביתה לשתות תה. טילר התאבל
על זנבו ובכה מרות כל הערב. מרגלו של פרדי הוצאתי כמה
כדוריות עופרת וחבשתי את הפצעים שלו ושל טילר.
בדיוק כשטילר בכה לתוך הממחטה שלי נשמעה דפיקה
בדלת. עמד שם בני הגירית עם מריצה מכוסה בד ועם חיוך
רחב על פניו.
"הלו" האם טילר ומילי כאן? לא מצאתי אותם בדירה שלהם."
כן.. טילר! בני רוצה לראות אתך" קראתי והוא יצאה אלינו
"
לאט, עם ראש מורכן ומושך קלות באפו. 
"הלו בני. אני במצב רוח גרוע היום וקשה לי לשוחח אתך. אני
חושב שאלך עוד מעט הביתה. מצטער..."
"חכה רגע, טילר. רציתי להראות לך משהו."
בני הוריד בד שכיסה את המריצה וכולם ראו שתי שורות של
צנצנות ריבת תות שדה העומדות עליה.
"אוו!" קרא טילר
מופתע וחיוך רחב
התפשט על פניו.
"למדתי איך
לעשות אותה
בשבילך, כי ידעתי
כמה שאתה אוהב
את הריבה."
"הו, תודה לך, בני,
תודה." טילר טיפס
על המריצה ובדק
את הצנצנות
מקרוב.
"אכן, בני. בהחלט עזרת לו להתאושש" אמרתי.
"כן, עלמה גרסייה, חשבתי שזה ישמח אותו."
אחר כך ישבנו כולנו, נהנינו מתה ומריבה על לחם קלוי,
ושוחחנו על אירועי הערב. עוד הרבה זמן לקח עד שטילר
התגבר על אבוד זנבו, אך הריבה של בני עזרה לו בהחלט.
כמה ימים מאוחר יותר, בדרכי לכפר, עברתי ליד ביתו של
האיכר פרנקי ושמתי לב למשהו מוזר המודבק לדלת.
כשהתקרבתי ראיתי שזה זנבו של טילר עם איגרת מהאיכר
פרנקי, ממוענת לכל אלא שלהם הוא קרא "מזיקים מהיער"
באיגרת נכתב:
"לכל המזיקים האיומים מהיער. זו רק דוגמה קטנה למה שיקרה
למי שינסה לגנוב את הריבה הנהדרת שלי.
חתום - האיכר פרנקי".
אינני יודעת איך להתייחס לאיום הזה, אך אדאג שאף אחד
מהידידים השעירים שלי לא יתקרב לבית הלא-ידידותי הזה.
   </p>
   """),
    Day(
        id: 'd2',
        title: 'השיבולת',
        content:"""
<p>
    חיו ביחד שני עכברים קטנים, קורט ובורט, ותרנגול גדול.
העכברים ידעו רק לשיר ולרקוד ימים שלמים.
והתרנגול כל בוקר העיר את העולם בקריאה שלו ואחר כך
יצא לעבודה. ויום אחד, כשטאטא את החצר מצא שיבולת
גדולה.
"קורט! בורט!" קרא התרנגול "ראו מה מצאתי!"
באו העכברים ואומרים:
"צריך לדוש את השיבולת."
"ומי ידוש אותה?" שאל התרנגול.
"רק לא אני!" אמר קורט.
"טוב" אמר התרנגול "אני אדוש אותה. וניגש מיד לעבודה. "רק לא אני!" אמר בורט.
והעכברים בינתיים שיחקו בכדור בסיס.
כשהתרנגול גמר לדוש קרא:
"קורט! בורט! בואו וראו כמה גרעינים יצאו מהשיבולת." 
באו העכברים ואמרו:
"צריך עכשיו להביא את הגרעינים לטחנה, לטחון אותם
לקמח."
"ומי יביא אותם?" שאל התרנגול.
"רק לא אני!" אמר קורט.
"רק לא אני!" אמר בורט.
"טוב" אמר התרנגול "אביא אותם לטחנה."
העכברים שיחקו בדילוגים. קופצים זה מעל זה ונהנים. הוא שם את הגרעינים על הכתף והלך. ובאותו הזמן
חזר התרנגול מהטחנה ושוב קורא:
"בואו, קורט ובורט! הבאתי קמח!"
באו העכברים ואומרים:
"כן, תרנגולת. עכשיו צריך ללוש בצק ולאפות כיסנים!" 
"ומי ילוש בצק" שאל התרנגול.
והעכברים כמו קודם:
"רק לא אני!" קורא קורט.
"רק לא אני!" קורא בורט.
התרנגול חשב וחשב ובסוף אמר:
"כנראה אני אלוש את הבצק."
הוא לש בצק, הביא עצים, הבעיר אש בתנור וכשהתנור
התחמם שם בו את הכיסנים.
גם העכברים לא מאבדים זמן. הם רוקדים ושרים.
כשהכיסנים היו מוכנים התרנגול הוציא אותם מהתנור ושם על
השולחן. והעכברים כבר שם. עכשיו לא צריך לקרוא להם.
"אוך, כמה אני רעב!" קורא קורט.
"כמה שמתחשק לי כיסן!" אומר בורט. 
הם התיישבו לשולחן והתרנגול אומר:
"לאט לכם. חכו רגע! אמרו קודם מי מצא את
השיבולת?"
"אתה מצאת" עונים העכברים בקול.
"ומי דש אותו?"
"אתה דשת." עונים העכברים.
"ומי הביא את הגרעינים לטחנה?"
"גם כן אתה" עונים העכברים בלחש.
"ומי לש בצק? מי הביא עצים? מי חימם את התנור, מי
אפה כיסנים?"
"אתה, אתה" עונים העכברים, והקול שלהם נשמע רק
בקושי.
"ומה אתם עשיתם?"
מה יכלו כבר להגיד? אין מה לומר. קמו קורט ובורט
מהשולחן והתרנגול לא עצר אותם.
לא לבטלנים כאלה הוא אפה את הכיסנים!</p> """),

    Day(id: 'd3', title: 'איך נוצרו', content: """
    
                    
                    <p>
               חיו ביחד שני עכברים קטנים, קורט ובורט, ותרנגול גדול.
העכברים ידעו רק לשיר ולרקוד ימים שלמים.
והתרנגול כל בוקר העיר את העולם בקריאה שלו ואחר כך
יצא לעבודה. ויום אחד, כשטאטא את החצר מצא שיבולת
גדולה.
"קורט! בורט!" קרא התרנגול "ראו מה מצאתי!"
באו העכברים ואומרים:
"צריך לדוש את השיבולת."
"ומי ידוש אותה?" שאל התרנגול.
"רק לא אני!" אמר קורט.
"טוב" אמר התרנגול "אני אדוש אותה. וניגש מיד לעבודה. "רק לא אני!" אמר בורט.
והעכברים בינתיים שיחקו בכדור בסיס.
כשהתרנגול גמר לדוש קרא:
"קורט! בורט! בואו וראו כמה גרעינים יצאו מהשיבולת." 
באו העכברים ואמרו:
"צריך עכשיו להביא את הגרעינים לטחנה, לטחון אותם
לקמח."
"ומי יביא אותם?" שאל התרנגול.
"רק לא אני!" אמר קורט.
"רק לא אני!" אמר בורט.
"טוב" אמר התרנגול "אביא אותם לטחנה."
העכברים שיחקו בדילוגים. קופצים זה מעל זה ונהנים. הוא שם את הגרעינים על הכתף והלך. ובאותו הזמן
חזר התרנגול מהטחנה ושוב קורא:
"בואו, קורט ובורט! הבאתי קמח!"
באו העכברים ואומרים:
"כן, תרנגולת. עכשיו צריך ללוש בצק ולאפות כיסנים!" 
"ומי ילוש בצק" שאל התרנגול.
והעכברים כמו קודם:
"רק לא אני!" קורא קורט.
"רק לא אני!" קורא בורט.
התרנגול חשב וחשב ובסוף אמר:
"כנראה אני אלוש את הבצק."
הוא לש בצק, הביא עצים, הבעיר אש בתנור וכשהתנור
התחמם שם בו את הכיסנים.
גם העכברים לא מאבדים זמן. הם רוקדים ושרים.
כשהכיסנים היו מוכנים התרנגול הוציא אותם מהתנור ושם על
השולחן. והעכברים כבר שם. עכשיו לא צריך לקרוא להם.
"אוך, כמה אני רעב!" קורא קורט.
"כמה שמתחשק לי כיסן!" אומר בורט. 
הם התיישבו לשולחן והתרנגול אומר:
"לאט לכם. חכו רגע! אמרו קודם מי מצא את
השיבולת?"
"אתה מצאת" עונים העכברים בקול.
"ומי דש אותו?"
"אתה דשת." עונים העכברים.
"ומי הביא את הגרעינים לטחנה?"
"גם כן אתה" עונים העכברים בלחש.
"ומי לש בצק? מי הביא עצים? מי חימם את התנור, מי
אפה כיסנים?"
"אתה, אתה" עונים העכברים, והקול שלהם נשמע רק
בקושי.
"ומה אתם עשיתם?"
מה יכלו כבר להגיד? אין מה לומר. קמו קורט ובורט
מהשולחן והתרנגול לא עצר אותם.
לא לבטלנים כאלה הוא אפה את הכיסנים!     
     </p>
     """),
    Day(id: 'd4', title: '2', content: 'gsfdgsfdgdhgfhgfhfd'),
    Day(id: 'd1', title: '3', content: 'gsfdgsfdgdhgfhgfhfd'),
    Day(id: 'd1', title: '4', content: 'gsfdgsfdgdhgfhgfhfd'),
    Day(
        id: 'd1',
        title: '5',
        content: 'gsfdgsfdgdhgfhgfhfd'),
    Day(id: 'd1', title: '6', content: 'gsfdgsfdgdhgfhgfhfd'),
    Day(id: 'd1', title: '7', content: 'gsfdgsfdgdhgfhgfhfd'),
    Day(
        id: 'd1',
        title: 'סל  עשב',
        content: 'gsfdgsfdgdhgfhgfhfd'),
    Day(
        id: 'd1',
        title: 'סשי בה',
        content: 'gsfdgsfdgdhgfhgfhfd'),
    Day(
        id: 'd1',
        title: 'ה',
        content: 'gsfdgsfdgdhgfhgfhfd'),
    Day(
        id: 'd1',
        title: 'סה',
        content: 'gsfdgsfdgdhgfhgfhfd'),
    Day(
        id: 'd1',
        title: 'סר',
        content: 'gsfdgsfdgdhgfhgfhfd'),
    Day(id: 'd1', title: 'סדר כפר', content: 'gsfdgsfdgdhgfhgfhfd'),
    Day(id: 'd1', title: 'בנים', content: 'gsfdgsfdgdhgfhgfhfd'),
  ];
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: Color.fromARGB(255, 245, 213, 118),
        title: Text('אגדות'),
      ),
    
      drawer: MyDrawer(),// from drawer.dart file for More readable
      
      body: ListView.builder(
        padding: const EdgeInsets.all(5.0),
        itemCount: daylist.length,
        itemBuilder: (ctx, i) => Column(
          children: <Widget>[
            DayItem(daylist[i].id, daylist[i].title, daylist[i].content),
            Divider(height: 10.0, color: Colors.grey),
          ],
        ),
      ),
    );
  }
}
